{
  "items": [
    {
      "title": "Looking for Lead Maintainers",
      "date": "June 2015",
      "content": "<p>We are activley looking for more developers to help take this project to the next level. If interested please email <a href='mailto:nemtcan@gmail.com'>nmccready</a>.</p>"
    },
    {
      "title": "Website updates",
      "date": "June 2015",
      "content": "<p>The community has been chipping in on the documentation which has been great! Keep it coming please!</p>"
    },
    {
      "title": "What is next, 2.1.X or 3.0.X?",
      "date": "Dec 12 2014",
      "content": "<p>Things are changing for the good, and we want your input. Please read the <a href='https://github.com/angular-ui/angular-google-maps/blob/master/README.markdown'>README.md<a/> and vote at the <a href='http://goo.gl/4YDSao'>Poll.<a/> <br/> Voting will end Dec 20th!.</p>"
    },
    {
      "title": "Like writing Specs?",
      "date": "Nov 30 2014",
      "content": "<p>Do you like picking libraries apart? Then we need you! We really need better coverage against our directives, factories, and services. This would help catch regression errors. This would go a long way beyond plunkrs and examples.</p>"
    },
    {
      "title": "Polylines and Polygons",
      "date": "Nov 30 2014",
      "content": "<p>These plural directives currently allow for both expressions and key (model) evaluations. We will be trying to upgrade the other plural directives to include these features as well. This functionality is currently on master and will be in the 2.0.12 release.</p>"
    },
    {
      "title": "2.0.11 Documentation Added",
      "date": "Nov 30 2014",
      "content": "<p>All of the documentation has been updated to the master API. We are still behind on documenting many updates and changes. As a community feel free to pull request (PR) changes to keep this websit up to date.</p>"
    },
    {
      "title": "1.1.0 Documentation Added",
      "date": "May 17 2014",
      "content": "<p>Many undocumented directives/features are now.. documented :). Documentation now reflects 1.1.0 (was develop branch)!!</p>"
    },
    {
      "title": "New change log page",
      "date": "May 4 2014",
      "content": "<p>We now have a brand new page hosting the changelog of angular-google-maps! It's <a href='/changelog'>over here</a>!"
    },
    {
      "title": "GeoJSON support",
      "date": "Mar. 22 2014",
      "content": "<p>The google-maps, circle, marker, markers, polygon, polyline, window & windows directive now support <a href='http://geojson.org/geojson-spec.html'>GeoJSON</a> coordindates, in addition to the standard latitude/longitude object parameters.  See <a href='/api'>the docs</a>!</p>"
    },
    {
      "title": "Layer directive hotfix",
      "date": "Feb. 10 2014",
      "content": "<p>There was a bug in the layer directive which prevented passing options to the underlying layer. This has been fixed in version 1.0.10.</p><p>Thanks <a href='https://github.com/netmonster01' rel='external'>netmonster01</a> for reporting this!</p>"
    },
    {
      "title": "New directive: rectangle",
      "date": "Feb. 8 2014",
      "content": "<p>Thanks to <a href='https://github.com/ChenTsuLin' rel='external'>ChenTsuLin</a>, we now have a rectangle directive. See <a href='/api#rectangle'>the docs</a>!</p>"
    },
    {
      "title": "New website is finally online!",
      "date": "Jan. 11 2014",
      "content": "<p>We are pleased to announce that our new website is finally online over at http://angular-google-maps.org ! The demo is still under development and the docs are almost 100% finished. Please leave your feedback over at our <a href='https://plus.google.com/communities/101653511105172739950?utm_source=websiten&utm_medium=link' rel='external'>Google+ community</a> or file issues in our <a href='https://github.com/nlaplante/angular-google-maps/issues?state=open' rel='external'>issue tracker</a>.</p>"
    },
    {
      "title": "Official Google+ community",
      "date": "Dec. 17 2013",
      "content": "<p>We now have our <a href='https://plus.google.com/communities/101653511105172739950' rel='external'>Google+ community</a>! Please join to share your experience with this library, tips and tricks and to receive official announcements.</p>"
    },
    {
      "title": "angular-google-maps 1.0.0 released!",
      "date": "Nov. 27 2013",
      "content": "<p>We are proud to announce that the first stable version of angular-google-maps has just be released!</p><p>The r1-dev branch has been merged back in master, and the old library is available in the legacy branch.</p>"
    },
    {
      "title": "New website in the works",
      "date": "Oct. 20 2013",
      "content": "<p>A brand new website for angular-google-maps is in the works. It will be more complete than the actual one and actually provide a complete API documentation as well as a quickstart guide. It will replace the existing site as soon as the next library version is released.</p>"
    },
    {
      "title": "master branch moving to legacy soon",
      "date": "Oct. 8 2013",
      "content": "<p>For users of the current <code>master</code> branch, please note that it will renamed to <code>legacy</code> as soon as <code>r1-dev</code> has been completed and tagged as a release. The angular-google-maps website will reflect the api of the new <code>master</code> branch.</p>"
    },
    {
      "title": "AngularJS 1.2 support",
      "date": "Sept. 21 2013",
      "content": "<p>angular-google-maps supports AngularJS 1.2 in the <code>r1-dev</code> branch, which will become the <code>master</code> branch once released.</p>"
    },
    {
      "title": "Code overhaul",
      "date": "May 11 2013",
      "content": "<p>A new branch has been created which will be used to rewrite most of angular-google-maps and split it in separate directives. This will allow a simplified development process and easier overall integration in your projects.</p><p>Check out the <a href='https://github.com/nlaplante/angular-google-maps/tree/r1-dev'>r1-dev</a> branch now!"
    }
  ]
}
